{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_data", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(7,7)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(3,3)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn0", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(1,1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2,2)"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit1_sc_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit1_sc", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[20, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[30, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit2_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[49, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit3_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit3_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage1_unit3_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage1_unit3_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage1_unit3_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage1_unit3_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[66, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0], [78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit1_sc_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit1_sc", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "inputs": [[73, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[83, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit2_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[102, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit3_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit3_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit3_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0], [113, 0, 0], [114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit3_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit3_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit3_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[119, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit4_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0], [122, 0, 0], [123, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit4_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit4_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage2_unit4_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0], [130, 0, 0], [131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage2_unit4_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage2_unit4_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage2_unit4_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[136, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0], [140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[145, 0, 0], [146, 0, 0], [147, 0, 0], [148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit1_sc_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit1_sc", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(2,2)", 
        "workspace": "512"
      }, 
      "inputs": [[143, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[153, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[156, 0, 0], [157, 0, 0], [158, 0, 0], [159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit2_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[164, 0, 0], [165, 0, 0], [166, 0, 0], [167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit2_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[170, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[172, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit3_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[173, 0, 0], [174, 0, 0], [175, 0, 0], [176, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit3_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit3_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit3_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[181, 0, 0], [182, 0, 0], [183, 0, 0], [184, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit3_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit3_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit3_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[187, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[189, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit4_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[190, 0, 0], [191, 0, 0], [192, 0, 0], [193, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit4_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit4_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[196, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit4_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[198, 0, 0], [199, 0, 0], [200, 0, 0], [201, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit4_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit4_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit4_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[204, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[206, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit5_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[207, 0, 0], [208, 0, 0], [209, 0, 0], [210, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit5_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit5_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[213, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit5_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[215, 0, 0], [216, 0, 0], [217, 0, 0], [218, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit5_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit5_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit5_conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[221, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[223, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit6_bn1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit6_bn1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit6_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit6_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "stage3_unit6_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[224, 0, 0], [225, 0, 0], [226, 0, 0], [227, 0, 0], [228, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "stage3_unit6_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit6_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "stage3_unit6_conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "limited_workspace", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "inputs": [[230, 0, 0], [231, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "stage3_unit6_bn2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit6_bn2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "stage3_unit6_bn2_moving_mean", 
